{
  "backend/main.mo": "Main backend actor defining Product, Cart, Order, and UserProfile types with CRUD operations for products, cart management, order processing, and role-based access control using MixinAuthorization and AccessControl modules.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence issues: admin panel access problems, product catalog display failures, and backend getProducts query verification needs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration, highlighting key functionality like product display, cart management, checkout flow, and admin panel with authentication.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH color system variables for light and dark modes, including primary, secondary, accent, and UI component colors.",
  "frontend/index.html": "HTML entry point with page title 'yourdailysprtshop' and root div mounting the React application via main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for product catalog, cart, checkout, order confirmation, admin panel, admin orders, and stickers pages, all wrapped in Layout component.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied screen component displaying appropriate messaging for unauthorized or unauthenticated users with login button or return to products option.",
  "frontend/src/components/AdminUserManagement.tsx": "Admin user management component allowing admins to grant admin privileges to other users by entering their Internet Identity principal with validation and error handling.",
  "frontend/src/components/CartItem.tsx": "Cart item component displaying product details with image (special handling for Vixen T.T Ball), quantity controls with stock validation, remove button, and subtotal calculation in rupees.",
  "frontend/src/components/Layout.tsx": "Main layout component with header navigation, authentication controls via Internet Identity, cart badge, and admin panel access for authorized users. Includes social media links and handles login/logout with toast notifications.",
  "frontend/src/components/ProductCard.tsx": "Displays individual product information in a card format with image, category badge, price, stock status, and add-to-cart functionality. Handles authentication checks and shows out-of-stock states.",
  "frontend/src/components/ProductForm.tsx": "Form component for adding or editing products with fields for name, description, category (table tennis/badminton), and stock. Handles validation and submission for both create and update operations.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality. Creates AuthClient with configurable options and manages identity state throughout the application lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including products, cart management, checkout, orders, user profiles, and admin functions. Each mutation automatically invalidates relevant queries on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components like buttons, cards, borders, and sidebar elements.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AdminOrders.tsx": "Admin page displaying all customer orders with status badges, payment methods, and customer details. Includes authentication and admin role checks with access control.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard for managing products (add, edit, delete) and users. Features authentication checks, product listing with category labels, and navigation to orders page.",
  "frontend/src/pages/Cart.tsx": "Shopping cart page showing cart items with products, quantities, and subtotal. Handles unauthenticated users, empty cart states, and provides checkout navigation.",
  "frontend/src/pages/Checkout.tsx": "Checkout page with payment method selection (cash/Google Pay), delivery address input, customer name field, form validation, and order completion functionality.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation success page displaying a checkmark icon, thank you message, and button to continue shopping after successful order placement.",
  "frontend/src/pages/ProductCatalog.tsx": "Main product catalog page component that fetches and displays all products in a grid layout with loading, error, and empty states. Includes a hero banner and uses ProductCard components for individual product display.",
  "frontend/src/pages/StickersComingSoon.tsx": "Placeholder page component displaying a \"coming soon\" message for stickers category with a button to navigate back to the main product catalog.",
  "frontend/src/types.ts": "TypeScript type definitions for Product, CartItem, and Cart interfaces used throughout the frontend application.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom colors using OKLCH color space, extended theme settings, animations, and plugin integrations for typography and container queries.",
  "project_state.json": "Project metadata tracking known issues with admin panel access and product display, along with existing feature requests to debug and fix these problems."
}