{
  "backend/main.mo": "Main backend actor defining data types (Product, Cart, Order, CustomSticker, UserProfile) and implementing business logic for e-commerce operations including product management, cart operations, order processing, custom sticker creation, and user profile management with role-based access control.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: restoring the admin panel link in header navigation (Layout.tsx) and ensuring admin role checking logic works correctly (useQueries.ts), both with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing the React application structure with TanStack Router, product catalog, cart, checkout flow, admin panel, stickers page, authentication, and styling using Tailwind with OKLCH color system.",
  "frontend/index.css": "Global CSS with Tailwind directives defining design tokens using OKLCH color space for light and dark themes, including colors for background, foreground, primary, secondary, destructive, borders, and sidebar components.",
  "frontend/index.html": "HTML entry point with page title \"yourdailysprtshop\" and root div mounting the React application via main.tsx script.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with routes for product catalog, cart, checkout, order confirmation, admin panel, admin orders, and stickers pages, all wrapped in a shared Layout component.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied screen component displaying appropriate messaging for unauthorized admin access attempts, with login button for unauthenticated users and return to products button for all users.",
  "frontend/src/components/AdminUserManagement.tsx": "Admin user management component providing a form to grant admin privileges to users by entering their Internet Identity principal, with validation and error handling using toast notifications.",
  "frontend/src/components/CartItem.tsx": "Cart item component displaying product details with image mapping logic, quantity controls with stock validation, remove button, and price calculation using formatCurrency utility, fetching only regular products (not custom stickers).",
  "frontend/src/components/CustomStickerCard.tsx": "React component that displays a custom sticker in a card layout with image, name, description, category badge, and price. Includes a disabled 'Add to Cart' button that shows an error toast since custom stickers cannot be added to cart.",
  "frontend/src/components/CustomStickerForm.tsx": "Form component for creating custom stickers with fields for name, description, price, category, and image upload. Handles image validation (type and size), converts price from rupees to paise, uploads images as ExternalBlob with progress tracking, and submits to backend.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header containing navigation links (Products, Stickers, Admin Panel), shopping cart icon with item count badge, and authentication button. Handles login/logout with Internet Identity and conditionally shows admin link based on user permissions.",
  "frontend/src/components/ProductCard.tsx": "Product card component displaying product image (mapped by category or name), name, description, category badge, price, stock status, and 'Add to Cart' button. Handles authentication checks and cart operations with toast notifications.",
  "frontend/src/components/ProductForm.tsx": "Form component for adding or editing products with fields for name, description, category, stock, and price. Validates inputs, converts price from rupees to paise, and submits to backend using add or update mutations.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages the backend actor instance based on Internet Identity authentication state. Returns anonymous actor when unauthenticated or authenticated actor with identity, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication on ICP, providing login/logout functionality, identity management, and authentication status tracking with delegation validation.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend API calls including product fetching, cart management (get/add/update/remove), order operations, user profile management, custom stickers, and admin functions using the actor from useActor hook.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes, including primary, secondary, accent, destructive, muted colors and sidebar styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AdminOrders.tsx": "Admin page displaying all orders with product details, custom stickers, order status badges, payment methods, and access control requiring admin authentication.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard for managing products (add/edit/delete) and users, with authentication checks and navigation to orders page, displaying product catalog with category labels.",
  "frontend/src/pages/Cart.tsx": "Shopping cart page showing cart items with quantities, calculating totals from both regular products and custom stickers, requiring authentication and providing checkout navigation.",
  "frontend/src/pages/Checkout.tsx": "Checkout page component that handles order placement with customer details, delivery address, and payment method selection. Calculates cart total from both regular products and custom stickers, validates inputs, and submits checkout via mutation.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation page displaying a success message with a green checkmark icon and a button to continue shopping.",
  "frontend/src/pages/ProductCatalog.tsx": "Main product catalog page that displays all products in a grid layout with loading states, error handling, and a hero banner. Renders ProductCard components for each product.",
  "frontend/src/pages/Stickers.tsx": "Custom stickers management page where authenticated users can view their created stickers and open a dialog to create new ones. Displays CustomStickerCard components in a grid.",
  "frontend/src/pages/StickersComingSoon.tsx": "Empty placeholder file for a coming soon page related to stickers functionality.",
  "frontend/src/types.ts": "TypeScript type definitions for Product, CartItem, and Cart interfaces used throughout the frontend application.",
  "frontend/src/utils/formatCurrency.ts": "Utility function that converts prices from paise (smallest currency unit) to rupees with proper decimal formatting and rupee symbol.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and sessionStorage values, supporting both regular and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, custom animations, and typography/container-queries plugins.",
  "project_state.json": "Project state tracking file for Daily Sports Shop with a known issue about missing admin panel after Version 29 deployment. Contains two existing features for restoring admin panel navigation and admin role checking, plus one pending feature request for verifying the /admin route configuration."
}