{
  "backend/main.mo": "Main backend actor implementing e-commerce functionality with products, carts, orders, and user profiles, including role-based access control (admin/user permissions) and authorization checks for all operations.",
  "backend/migration.mo": "Migration module that updates the Vixen T.T Ball product price from ₹18 to ₹20 by mapping over the products collection during actor upgrades.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence bug fixes: add-to-cart functionality with cart badge updates (REQ-25) and cash-on-delivery payment method selection (REQ-27).",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components, pages, hooks, and configuration files describing the UI structure, routing, state management, and styling for the yourdailysprtshop e-commerce application.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH color system variables for light and dark modes with neutral grayscale theme (no vibrant colors despite summary claim).",
  "frontend/index.html": "HTML entry point with page title 'yourdailysprtshop' and root div mounting the React application via main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for product catalog, cart, checkout, order confirmation, admin panel, and stickers page, all wrapped in shared Layout component.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied UI component displaying appropriate messaging for unauthorized admin access attempts, with login button for unauthenticated users and return-to-products option.",
  "frontend/src/components/CartItem.tsx": "Cart item component displaying product details with quantity controls, remove button, and subtotal calculation, including special image mapping for Vixen T.T Ball product to use image.png.",
  "frontend/src/components/Layout.tsx": "Main layout component with header navigation, authentication controls (Internet Identity login/logout), shopping cart badge, and admin access for authorized users. Includes footer with social media links.",
  "frontend/src/components/ProductCard.tsx": "Displays individual product information in a card format with image, name, description, price, stock status, and add-to-cart functionality. Handles authentication checks before adding items to cart.",
  "frontend/src/components/ProductForm.tsx": "Form component for adding new products or editing existing ones with fields for name, description, price, category (table tennis or badminton), and stock quantity. Includes validation and submission handling.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Handles actor initialization with admin token and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality. Manages AuthClient creation, identity persistence, and authentication status tracking throughout the application.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for data fetching and mutations including products, cart operations, checkout, orders, user profiles, and admin functions. Handles query invalidation and error states for all backend interactions.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components like buttons, cards, sidebars, and charts.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page for managing products with CRUD operations, requiring authentication and admin privileges to access.",
  "frontend/src/pages/Cart.tsx": "Shopping cart page displaying cart items with product details, quantities, and order summary, requiring user authentication.",
  "frontend/src/pages/Checkout.tsx": "Checkout page allowing authenticated users to select payment method (cash or Google Pay) and complete their order.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation page displaying success message after checkout with option to continue shopping.",
  "frontend/src/pages/ProductCatalog.tsx": "Main product catalog page displaying all available products in a grid layout with hero banner and loading states.",
  "frontend/src/pages/StickersComingSoon.tsx": "Placeholder page indicating stickers category is under development with navigation back to main catalog.",
  "frontend/src/types.ts": "TypeScript type definitions for Product, CartItem, and Cart entities used throughout the application.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and functions to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, typography, container queries, animations, and extended theme properties for a design system with sidebar, chart, and UI component styling.",
  "project_state.json": "Project state document for a sports e-commerce shop selling table tennis balls and badminton shuttles, tracking architectural decisions, multi-admin support, known issues (incorrect Vixen T.T Ball pricing/image, broken add-to-cart), and existing features including product catalog, cart, and checkout functionality."
}