{
  "backend/main.mo": "Main actor implementing an e-commerce backend with product management, shopping cart, orders with delivery address and customer name, user profiles, and role-based access control using authorization mixins.",
  "backend/migration.mo": "Migration module that transforms old Order type (without delivery address/customer name) to new Order type with default values for backward compatibility.",
  "feature_evidence.json": "Feature evidence report documenting three completed features: admin orders page, Vixen T.T Ball product image update, and multi-admin support with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, product catalog, cart, checkout with delivery address, admin panel with user management, and order management pages.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color system with neutral grays and chart colors for light and dark modes.",
  "frontend/index.html": "HTML entry point with page title set to 'yourdailysprtshop' and root div for React mounting.",
  "frontend/src/App.tsx": "TanStack Router configuration defining routes for product catalog, cart, checkout, order confirmation, admin panel, admin orders, and stickers pages wrapped in Layout component.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied component displaying appropriate messaging for unauthorized admin access with login option for unauthenticated users and return-to-products button.",
  "frontend/src/components/AdminUserManagement.tsx": "Admin user management component with form to grant admin privileges to users by entering their Internet Identity principal with validation and error handling.",
  "frontend/src/components/CartItem.tsx": "Displays a single cart item with product image, details, quantity controls (increment/decrement), and remove button. Handles quantity updates with stock validation and provides user feedback via toasts.",
  "frontend/src/components/Layout.tsx": "Main layout component providing the site header with navigation (Products, Stickers, Admin), shopping cart with item count badge, and authentication controls. Includes footer with social media links and handles login/logout flows.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image, name, description, price, stock status, and add-to-cart button. Handles product images based on category or specific product names and requires authentication before adding to cart.",
  "frontend/src/components/ProductForm.tsx": "Form component for adding or editing products with fields for name, description, price, category (table tennis or badminton), and stock. Validates inputs and submits to backend via mutations with toast notifications.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on authentication state. Automatically recreates the actor when identity changes and invalidates dependent queries for data refetching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for managing user login/logout state. Creates and manages AuthClient with configurable options and exposes identity, login status, and authentication methods to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including products, cart operations, checkout, orders, user profiles, and admin functions. Uses the actor from useActor hook to interact with the Internet Computer backend.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for theming including light and dark mode color schemes for UI components like cards, buttons, borders, and sidebar elements.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AdminOrders.tsx": "Admin page component that displays all customer orders in a table format with order details, status badges, payment methods, and product information. Requires admin authentication to access.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard component for managing products and users, featuring product CRUD operations, navigation to orders page, and admin user management. Includes ProductForm dialog and requires admin authentication.",
  "frontend/src/pages/Cart.tsx": "Shopping cart page that displays cart items with products, quantities, and prices, calculates subtotal, and provides checkout navigation. Requires user authentication and shows empty state when cart is empty.",
  "frontend/src/pages/Checkout.tsx": "Checkout page component that collects payment method (cash or Google Pay) and delivery address, displays order summary with total, and processes order completion. Requires authentication and validates delivery address before submission.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation page that displays a success message with a green checkmark icon and a button to continue shopping after order placement.",
  "frontend/src/pages/ProductCatalog.tsx": "Main product catalog page displaying all products in a grid layout with hero banner, loading states, error handling, and empty state messaging.",
  "frontend/src/pages/StickersComingSoon.tsx": "Placeholder page for upcoming stickers category with a centered card showing a coming soon message and navigation back to main catalog.",
  "frontend/src/types.ts": "TypeScript type definitions for Product, CartItem, and Cart entities used throughout the frontend application.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and session storage, supporting both regular and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme settings, animations, and plugin integrations for typography and container queries.",
  "project_state.json": "Project state file documenting the e-commerce application architecture, existing features (admin orders, multi-admin support), pending feature requests, and image requirements for table tennis ball products."
}