{
  "backend/main.mo": "Main actor implementing an e-commerce backend with product management, shopping cart, orders, user profiles, and role-based access control using Internet Identity principals. All products have a hardcoded price of ₹20.",
  "backend/migration.mo": "Migration module that handles canister upgrades by preserving state and updating all product prices to ₹20 during migration.",
  "feature_evidence.json": "Empty feature evidence report with no features documented.",
  "frontend-file-summaries.txt": "Consolidated summaries of frontend files describing a React e-commerce application with TanStack Router, product catalog, cart, checkout, admin panel, authentication via Internet Identity, and OKLCH color theming.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining design tokens for light and dark modes including primary, secondary, accent, and destructive colors.",
  "frontend/index.html": "HTML entry point with page title 'yourdailysprtshop' and root div for React mounting.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for product catalog, cart, checkout, order confirmation, admin panel, admin orders, and stickers page, all wrapped in Layout.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied screen component showing authentication/authorization error with login button for unauthenticated users or return-to-products button for unauthorized users.",
  "frontend/src/components/AdminUserManagement.tsx": "Admin user management component with form to grant admin privileges by entering Internet Identity principal IDs with validation and error handling.",
  "frontend/src/components/CartItem.tsx": "Cart item component displaying product details with quantity controls, remove button, and subtotal calculation, using specific image for Vixen T.T Ball product.",
  "frontend/src/components/Layout.tsx": "Main layout component with header navigation, authentication controls via Internet Identity, cart badge with item count, and footer with social links. Handles login/logout flows and admin access.",
  "frontend/src/components/ProductCard.tsx": "Displays individual product information in a card format with image, category badge, price, stock status, and add-to-cart functionality. Requires authentication to add items to cart.",
  "frontend/src/components/ProductForm.tsx": "Form component for adding or editing products with fields for name, description, category, and stock. Handles validation and submission for both create and update operations.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flows, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend data operations including products, cart, orders, user profiles, and admin functions. Provides queries and mutations with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration file defining CSS custom properties for light and dark themes, including colors for UI components, charts, and sidebar elements.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AdminOrders.tsx": "Admin page displaying all customer orders in a table with status badges, payment methods, and product details. Includes authentication and admin role checks with access denial for unauthorized users.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard for managing products and users, featuring product CRUD operations (create, edit, delete) and user management. Includes authentication checks and restricts access to admin users only.",
  "frontend/src/pages/Cart.tsx": "Shopping cart page displaying cart items with product details, quantities, and order summary. Requires authentication and shows empty state or login prompt when appropriate.",
  "frontend/src/pages/Checkout.tsx": "Checkout page handling order completion with payment method selection (cash/Google Pay), delivery address input, and order submission. Validates authentication and address before processing.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation success page displaying a checkmark icon and thank you message with a button to continue shopping.",
  "frontend/src/pages/ProductCatalog.tsx": "Main product catalog page component that fetches and displays all products in a grid layout with loading and error states, featuring a hero banner with the shop branding.",
  "frontend/src/pages/StickersComingSoon.tsx": "A placeholder page component that displays a 'coming soon' message for stickers category with a button to navigate back to the main product catalog.",
  "frontend/src/types.ts": "TypeScript type definitions for Product, CartItem, and Cart interfaces used throughout the frontend application.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and session storage, supporting both hash-based and browser-based routing with persistence capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space, typography, animations, and design tokens for the application's styling system.",
  "project_state.json": "Project metadata tracking feature requests to change product price display to Indian Rupees (₹) and set default price to ₹20, with a known issue regarding admin access configuration."
}