{
  "backend/main.mo": "Main actor defining the e-commerce backend with products, carts, orders, user profiles, and custom stickers, including authorization mixins and blob storage. Implements CRUD operations for products, cart management, order processing, and custom sticker creation with category support.",
  "backend/migration.mo": "Migration module that transforms old CustomSticker records (without category field) to new CustomSticker records by adding a default #sports category to all existing stickers.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features related to fixing custom sticker pricing functionality, verifying price conversion from rupees to paise in CustomStickerForm, and verifying price display conversion in CustomStickerCard.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration, detailing the React application structure with TanStack Router, authentication, product catalog, cart, checkout, admin panel, and custom sticker functionality.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH color system variables for light and dark modes, including primary, secondary, accent, and UI component colors.",
  "frontend/index.html": "HTML entry point with page title \"yourdailysprtshop\" and root div for React application mounting.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for product catalog, cart, checkout, order confirmation, admin panel, admin orders, and stickers pages, all wrapped in a shared Layout component.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied screen component displaying appropriate messaging for unauthorized users attempting to access admin features, with conditional login button for unauthenticated users and navigation back to products.",
  "frontend/src/components/AdminUserManagement.tsx": "Admin user management component allowing administrators to grant admin privileges to other users by entering their Internet Identity principal ID with validation and error handling.",
  "frontend/src/components/CartItem.tsx": "Displays a single cart item with quantity controls, supporting both regular products and custom stickers. Handles quantity updates with stock validation, removal from cart, and displays product/sticker details with appropriate images.",
  "frontend/src/components/CustomStickerCard.tsx": "Displays a custom sticker product card with image, category badge, name, description, and price (converted from paise to rupees). Includes an 'Add to Cart' button with loading state and error handling.",
  "frontend/src/components/CustomStickerForm.tsx": "Form component for creating custom stickers with image upload, name, description, price, and category selection. Validates inputs, converts price from rupees to paise, handles image file upload with progress tracking, and displays preview.",
  "frontend/src/components/Layout.tsx": "Main application layout with header navigation, authentication controls via Internet Identity, cart badge showing item count, and conditional admin panel link. Includes links to products, stickers, and social media.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with category-specific images, name, description, price, and stock information. Includes 'Add to Cart' functionality with authentication check and out-of-stock state handling.",
  "frontend/src/components/ProductForm.tsx": "Form component for adding or editing products with fields for name, description, category (table tennis or badminton), and stock. Handles validation, category enum conversion, and submission for both create and update operations.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for managing user login/logout state using DFINITY's AuthClient, with support for delegation identity validation and configurable authentication options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including product management, cart operations, checkout, orders, user profiles, custom stickers, and admin functions like user role management.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a comprehensive design system including colors, spacing, and theme variables for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up the React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AdminOrders.tsx": "Admin page component that displays all orders with product details, order status badges, payment methods, and delivery information, with access control checking for admin privileges.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page for managing products and users, featuring product CRUD operations, navigation to orders view, and access control with loading and denied states.",
  "frontend/src/pages/Cart.tsx": "Shopping cart page that displays cart items with product details, handles authentication checks, and shows order summary with checkout navigation. Includes loading states, empty cart handling, and calculates subtotal from cart items and product data.",
  "frontend/src/pages/Checkout.tsx": "Checkout page that collects customer name, delivery address, and payment method (cash or Google Pay), validates form inputs, and processes order completion. Requires authentication and displays cart summary with total before submitting the order.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation page that displays a success message with a checkmark icon after successful checkout. Provides a button to continue shopping and return to the product catalog.",
  "frontend/src/pages/ProductCatalog.tsx": "Main product catalog page that displays all available products in a grid layout with a hero banner. Handles loading states, error states, and empty product lists with appropriate UI feedback.",
  "frontend/src/pages/Stickers.tsx": "Custom stickers management page where authenticated users can view, create, and manage personalized stickers. Displays a grid of custom stickers with a dialog form for creating new ones.",
  "frontend/src/pages/StickersComingSoon.tsx": "Empty placeholder file for a future stickers coming soon page.",
  "frontend/src/types.ts": "TypeScript type definitions for Product, CartItem, and Cart entities used throughout the frontend application.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support. Includes functions to clear parameters from URLs and storage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with CSS variables, container settings, custom animations (accordion), border radius utilities, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file for a sports sticker app indicating known issues with custom pricing functionality not working for the sports category, with pending feature requests to fix price conversion (rupees to paise) and backend storage issues."
}