{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore missing admin panel access",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Restore the admin panel link in the header navigation for authenticated admin users",
      "acceptanceCriteria": [
        "Admin panel link appears in the header navigation for authenticated admin users",
        "Clicking the admin panel link navigates to the /admin route",
        "Non-admin users do not see the admin panel link",
        "Unauthenticated users do not see the admin panel link"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Add the admin panel navigation link back to the header navigation. The link should be conditionally rendered for authenticated users with admin privileges using the isCallerAdmin query hook. Position the link in the main navigation menu between existing nav items. The link should navigate to '/admin' and display 'Admin Panel' text."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Verify and ensure the /admin route is properly configured in the router",
      "acceptanceCriteria": [
        "Navigating directly to /admin route renders the AdminPanel component",
        "Admin panel route is included in the router configuration",
        "Access control correctly restricts non-admin users from viewing the admin panel"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify that the /admin route is properly configured and registered in the router configuration. Ensure the route maps to the AdminPanel component and that access control is correctly applied to restrict non-admin users from viewing the admin panel."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure the admin role checking logic is functioning correctly in the frontend",
      "acceptanceCriteria": [
        "Backend correctly validates admin principals against stored admin list",
        "Frontend correctly receives and interprets admin status from backend",
        "Admin-only UI elements conditionally render based on accurate admin status"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Verify that the useIsCallerAdmin query hook is correctly implemented and properly fetches the admin status from the backend isCallerAdmin method. Ensure the query is enabled only when the actor is available and authenticated, and that it returns the correct boolean admin status for conditional rendering of admin-only UI elements."
        }
      ]
    }
  ]
}